Repository: sheilagomes/wp-trad
Catalog: tm/PHP_en-pt_BR.tmx
Source language: en
Languages: pt_br

source: If your script uses session_register(), it will not work in environments where register_globals is disabled.
pt_br: Para cada nome, session_register() registra a variável global com o nome na sessão atual.

source: This registers a global variable.
pt_br: Esta registra uma variável global.

source: If you want to register a session variable from within a function, you need to make sure to make it global using the global keyword or the $GLOBALS[] array, or use the special session arrays as noted below.
pt_br: Se você quer registrar uma variável de sessão de dentro de uma função, você precisa definir ela como global() ou usar as matrizes de sessão como mostradas abaixo.

source: This function returns TRUE when all of the variables are successfully registered with the session.
pt_br: Esta função retorna TRUE quando todas de suas variáveis são registradas sem erro.

source: If session_start() was not called before this function is called, an implicit call to session_start() with no parameters will be made. $_SESSION does not mimick this behavior and requires session_start() before use.
pt_br: Se session_start() não foi chamada antes desta função ser chamada, uma chamada implícita para session_start() sem parâmetros será feita.

source: You can also create a session variable by simply setting the appropriate member of the $_SESSION or $HTTP_SESSION_VARS (PHP 4.1.0) array.
pt_br: Você também pode criar variáveis de sessão simplesmente definindo o membro apropriado de $_SESSION ou $HTTP_SESSION_VARS (PHP 4.1.0) matriz.

source: $barney = "A big purple dinosaur ."; session_register("barney"); $_SESSION["zim"] = "An invader from another planet ."; # The old way was to use $HTTP_SESSION_VARS $HTTP_SESSION_VARS["spongebob"] = "He's got square pants .";
pt_br: $barney = "Um grande dinossauro p uacute;rpura ."; session_register("barney"); $_SESSION["zim"] = "Um invasor de outro planeta ."; # The old way was to use $HTTP_SESSION_VARS $HTTP_SESSION_VARS["spongebob"] = "Ele conseguiu cal ccedil;as ajustadas .";

source: It is currently impossible to register resource variables in a session.
pt_br: Não é possível registrar correntemente variáveis resource numa sessão.

source: For example, you cannot create a connection to a database and store the connection id as a session variable and expect the connection to still be valid the next time the session is restored.
pt_br: Por exemplo, você não pode criar uma conexão para um banco de dados e guardar a id de conexão como uma variável de sessão e esperar que a conexão ainda esteja válida na próxima vez que a sessão estiver restaurada.

source: PHP functions that return a resource are identified by having a return type of resource in their function definition.
pt_br: Funções do PHP que retornam uma resource são identificadas por conterem um retorno do tipo resource em suas definições de função.

source: A list of functions that return resources are available in the resource types appendix.
pt_br: Uma lista de funções que retornam resources estão disponíveis em tipos resources appendix.

source: For example: $_SESSION[ 'var'] = 'ABC';
pt_br: Se $_SESSION (ou $HTTP_SESSION_VARS para PHP 4.0.6 ou inferior) é usada, para variável definida variable com $_SESSION. i.e. $_SESSION['var'] = 'ABC';

source: See also session_is_registered() and session_unregister().
pt_br: Veja também session_is_registered() eS session_unregister().

source: If path is specified, the path to which data is saved will be changed. session_save_path() needs to be called before session_start() for that purpose.
pt_br: Descrição

source: On some operating systems, you may want to specify a path on a filesystem that handles lots of small files efficiently.
pt_br: session_save_path() retorna o path do diretório atual usado para salvar os dados de sessão.

source: For example, on Linux, reiserfs may provide better performance than ext2fs.
pt_br: Se path está especificado, o path para aqueles dados que estão salvo será mudado.

source: See also the session.save_path configuration directive.
pt_br: Por exemplo, em Linux, reiserfs pode oferecer uma performance melhor do que ext2fs.

source: The effect of this function only lasts for the duration of the script.
pt_br: Descrição

source: The secure parameter was added in PHP 4.0.4.
pt_br: O efeito desta função apenas continua até a duração do script.

source: See also the configuration directives session.cookie_lifetime, session.cookie_path, session.cookie_domain, session.cookie_secure, and session_get_cookie_params().
pt_br: O parâmetro secure foi adicionado no PHP 4.0.4.

source: session_set_save_handler() sets the user-level session storage functions which are used for storing and retrieving data associated with a session.
pt_br: session_set_save_handler() session_set_save_handler() define a sequência de funções de armazenamento que é usada para guardar e devolver dados associados à sessão.

source: This is most useful when a storage method other than those supplied by PHP sessions is preferred. i.e.
pt_br: Esta é mais usual quando um quando um método de armazenamento, a não ser que aquele oferecido por sessões do PHP seja preferível. i.e.

source: Storing the session data in a local database.
pt_br: Guardar dados de sessão em um banco de dados local.

source: The "write" handler is not executed until after the output stream is closed.
pt_br: Você deve definir as opções de configuração session.save_handler para user em seu arquivo php.ini para session_set_save_handler() funcionar.

source: Thus, output from debugging statements in the "write" handler will never be seen in the browser.
pt_br: A função "write" handler não é executada até depois que o fluxo de saída esteja fechado.

source: If debugging output is necessary, it is suggested that the debug output be written to a file instead.
pt_br: Se a saída debugging é necessária, ao invés disso é sugerido que a saída debug seja escrita para um arquivo.

source: The write handler is not executed if the session contains no data; this applies even if empty session variables are registered.
pt_br: A função "write" handler não é executada se a sessão não contém dados; isto se aplica sempre se variáveis de sessão vazias são registradas.

source: This differs to the default file-based session save handler, which creates empty session files.
pt_br: Esta difere à sessão padrão de save handler baseado em arquivos, que cria arquivos de sessão vazios.

source: The following example provides file based session storage similar to the PHP sessions default save handler files.
pt_br: O seguinte exemplo oferece um aramzenamento de sessão baseado em arquivos similar a sessões de PHP padrões save handler files.

source: This example could easily be extended to cover database storage using your favorite PHP supported database engine.
pt_br: Este exemplo poderia facilmente ser extendido para outras bases de dados usando seu gerente de banco de dados favorito suportado pelo PHP.

source: Read function must return string value always to make save handler work as expected.
pt_br: A função "Read" deve retornar um valor string sempre que fizer o save handler trabalhar como o esperado.

source: Return empty string if there is no data to read.
pt_br: Retorna uma string vazia se não existe dados para ler.

source: Return values from other handlers are converted to boolean expression.
pt_br: Retorna valores de outros handlers que estejam convertidos para expressões booleanas.

source: TRUE for success, FALSE for failure.
pt_br: TRUE em sucesso, FALSE em falha.

source: Example 1. session_set_save_handler() example
pt_br: Exemplo 1. session_set_save_handler() exemplo

source: See also the session.save_handler configuration directive.
pt_br: ?php function open ($save_path, $session_name) {global $sess_save_path, $sess_session_name; $sess_save_path = $save_path; $sess_session_name = $session_name; return(true);} function close() {return(true);} function read ($id) {global $sess_save_path, $sess_session_name; $sess_file = "$sess_save_path / sess_$id"; if ($fp = @fopen($sess_file, "r")) {$sess_data = fread($fp, filesize($sess_file)); return($sess_data);} else {return(""); / / Deve retornar "" aqui.}} function write ($id, $sess_data) {global $sess_save_path, $sess_session_name; $sess_file = "$sess_save_path / sess_$id"; if ($fp = @fopen($sess_file, "w")) {return(fwrite($fp, $sess_data));} else {return(false);}} function destroy ($id) {global $sess_save_path, $sess_session_name; $sess_file = "$sess_save_path / sess_$id"; return(@unlink($sess_file));} / ************************************************ * AVISO - voc ecirc; precisa implementar alguns tipos* * de rotinas de garbage collection aqui. * ************************************************ / function gc ($maxlifetime) {return true;} session_set_save_handler ("open", "close", "read", "write", "destroy", "gc"); session_start(); / / Use o resto da sess atilde ;o normalmente?

source: session_start() creates a session or resumes the current one based on the current session id that's being passed via a request, such as GET, POST, or a cookie.
pt_br: session_start() cria uma sessão (ou resume a sessão atual baseada numa id de sessão sendo passada via uma variável GET ou um cookie).

source: If you want to use a named session, you must call session_name() before calling session_start().
pt_br: Se você quer usar uma sessão nomeada, você deve chamar session_name() antes de chamar session_start().

source: This function always returns TRUE.
pt_br: Esta função sempre retorna TRUE.

source: If you are using cookie-based sessions, you must call session_start() before anything is output to the browser.
pt_br: Se você está usando sessões baseadas em cookie, você deve chamar session_start() antes de qualquer coisa ser exibida para o navegador.

source: session_start() will register internal output handler for URL rewriting when trans-sid is enabled.
pt_br: session_start() irá registrar um handler de saída interno para URL reescrevendo quando trans-sid está habilitada.

source: If a user uses ob_gzhandler or like with ob_start(), the order of output handler is important for proper output.
pt_br: Se um usuário utiliza ob_gzhandler ou ob_start(), a ordem do handler de exibição é importante para a exibição apropriada.

source: For example, user must register ob_gzhandler before session start.
pt_br: Por exemplo, usuário deve registrar ob_gzhandler antes da sessão começar.

source: Use of zlib.output_compression is recommended rather than ob_gzhandler()
pt_br: Uso de zlib.output_compression é mais recomendado do que ob_gzhandler

source: session_unregister() unregisters the global variable named name from the current session.
pt_br: Descrição

source: If $_SESSION (or $HTTP_SESSION_VARS for PHP 4.0.6 or less) is used, use unset() to unregister a session variable.
pt_br: Nota:

source: This function does not unset the corresponding global variable for name, it only prevents the variable from being saved as part of the session.
pt_br: Esta função não elimina a variável global correspondente por name, ela apenas evita que a variável faça parte da sessão.

source: You must call unset() to remove the corresponding global variable.
pt_br: Você deve chamar unset() para eliminar a variável global correspondente.

source: If $_SESSION (or $HTTP_SESSION_VARS for PHP 4.0.6 or less) is used, use unset() to unregister session variable. i.e. $_SESSION = array();
pt_br: Nota:

source: End the current session and store session data.
pt_br: Descrição

source: Session data is usually stored after your script terminated without the need to call session_write_close(), but as session data is locked to prevent concurrent writes only one script may operate on a session at any time.
pt_br: Os dados de sessão sã geralmente guardados depois que o script termina sem a necessidade de chamar session_write_close(), mas como dados de sessão são trancados para evitar escritas concorrentes, apenas um script pode operar em uma sessão de cada vez.

source: When using framesets together with sessions you will experience the frames loading one by one due to this locking.
pt_br: Quando usando framesets junto com sessões você irá experimentar os frames sendo lidos um a um devido a esta trava.

source: You can reduce the time needed to load all the frames by ending the session as soon as all changes to session variables are done.
pt_br: Você pode reduzir o tempo necessário para ler todos os frames terminando a sessão tão logo todas as mudanças das variáveis de sessão estejam feitas.

source: Table 1. setcookie() parameters explained
pt_br: Tabela 1. setcookie() parameters explained

source: Example 1. setcookie() send examples
pt_br: Exemplo 1. setcookie() send examples

source: Example 2. setcookie() delete examples
pt_br: Exemplo 2. setcookie() delete examples

source: Sets a user function (error_handler) to handle errors in a script.
pt_br: Description

source: This function is an alias of stream_set_write_buffer().
pt_br: set_file_buffer - - Sinônimo de stream_set_write_buffer()

source: Example 1. setlocale() Examples
pt_br: Exemplo 1. setlocale() Examples

source: Set the number of seconds a script is allowed to run.
pt_br: Description

source: Set the type of variable var to type.
pt_br: Description

source: Example 1. settype() example
pt_br: Exemplo 1. settype() example

source: Calculates the sha1 hash of filename using the US Secure Hash Algorithm 1, and returns that hash.
pt_br: Calcula a hash sha1 de nomedoarquivo usando US Secure Hash Algorithm 1, e retorna esta hash.

source: The hash is a 40-character hexadecimal number.
pt_br: A hash é um número hexadecimal de 40 caracteres.

source: Upon failure, FALSE is returned.
pt_br: Em caso de falha é retornado FALSE.

source: See also sha1(), crc32(), and md5_file()
pt_br: Veja também sha1(), crc32(), e md5_file()

source: Calculates the sha1 hash of str using the US Secure Hash Algorithm 1, and returns that hash.
pt_br: Calcula a hash sha1 de str usando US Secure Hash Algorithm 1, e retorna esta hash.

source: See also sha1_file(), crc32(), and md5()
pt_br: Veja também sha1_file(), crc32(), e md5()

source: shmop_close() is used to close a shared memory block.
pt_br: Description

source: shmop_delete() is used to delete a shared memory block.
pt_br: Description

source: shmop_open() can create or open a shared memory block.
pt_br: Description

source: shmop_read() will read a string from shared memory block.
pt_br: Description

source: shmop_write() will write a string into shared memory block.
pt_br: Description

source: Removes shared memory from Unix systems.
pt_br: Description

source: This function does not work on Windows systems.
pt_br: Nota:

source: This function is an alias to highlight_file().
pt_br: Esta função é um apelido para highlight_file().

source: For more information see the documentation there.
pt_br: Para maiores informações veja a documentação lá.

source: See also highlight_string() and highlight_file().
pt_br: Veja também highlight_string() e highlight_file().

source: A function may be defined using syntax such as the following:
pt_br: Capítulo 13.

source: function foo ($arg_1, $arg_2,..., $arg_n) {echo "Example function.\n"; return $retval;}
pt_br: Funções

source: Any valid PHP code may appear inside a function, even other functions and class definitions.
pt_br: Funções definidas pelo usuário

source: In PHP 3, functions must be defined before they are referenced.
pt_br: Uma função pode ser definida usando-se a sintaxe como a seguinte:

source: Except when a function is conditionally defined such as shown in the two examples below.
pt_br: function foo ($argumento_1, $argumento_2,..., $argumento_n) {echo "Exemplo de função.\n"; return $valor_retornado;}

source: Its definition must be processed prior to being called.
pt_br: Qualquer código PHP válido pode aparecer dentro de uma função, mesmo outras funções e definições de classes.

source: Conditional functions
pt_br: No PHP3, as funções precisam ser definidas antes de serem referenciadas.

source: Example 13-2.
pt_br: Esse requisito não existe no PHP4.

source: ?php function foo() {function bar() {echo "I don't exist until foo() is called.\n";}} / * We can't call bar() yet since it doesn't exist. * / foo(); / * Now we can call bar(), foo()'s processesing has made it accessable. * / bar();?
pt_br: O PHP não suporta sobrecarga de funções, e também não é possível cancelar ou alterar a definição de funções previamente declaradas.

source: PHP 3 does not support variable numbers of arguments to functions, although default arguments are supported (see Default argument values for more information).
pt_br: O PHP3 não suporta número variável de argumentos para funções, apesar de os argumentos padrões serem suportados (veja Valores padrão de argumentos para mais informações).

source: PHP 4 supports both: see Variable-length argument lists and the function references for func_num_args(), func_get_arg(), and func_get_args() for more information.
pt_br: O PHP4 suporta ambos: veja Número de argumentos variável e as referências das funções func_num_args(), func_get_arg() e func_get_args() para mais informações.

source: Function arguments
pt_br: Argumentos de funções

source: This function shuffles (randomizes the order of the elements in) an array.
pt_br: Essa função mistura de forma aleatória os elementos de um array.

source: You must use srand() to seed this function.
pt_br: Você deve usar essa função em conjunto com srand().

source: Example 1. shuffle() example
pt_br: Exemplo de shuffle()

source: $numbers = range (1,20); srand ((float)microtime()*1000000); shuffle ($numbers); while (list (, $number) = each ($numbers)) {echo "$number ";}
pt_br: $numeros = range (1,20); srand ((float)microtime()*1000000); shuffle ($numeros); while (list (, $numero) = each ($numeros)) {echo "$numero ";}

source: See also arsort(), asort(), ksort(), rsort(), sort(), and usort().
pt_br: Veja também arsort(), asort(), ksort(), rsort(), sort() e usort().

source: Returns the hyperbolic sine of arg, defined as (exp(arg) - exp(-arg)) / 2.
pt_br: Retorna o seno hiperbólico de arg, definido como (exp(arg) - exp(-arg)) / 2.

source: See also sin(), asinh(), cos() and tan().
pt_br: Veja também sin(), asinh(), cos() e tan().

source: sin() returns the sine of the arg parameter.
pt_br: Descrição

source: ?php / / Precision depends on your precision directive print sin( deg2rad(60)); / / 0.866025403... print sin(60); / / -0.304810621...?
pt_br: ?php / / Precisão depende da diretiva precision print sin( deg2rad(60)); / / 0.866025403... print sin(60); / / -0.304810621...?

source: See also asin(), cos(), tan() and deg2rad().
pt_br: Veja também asin(), cos(), tan() e deg2rad().

source: The sizeof() function is an alias for count().
pt_br: A função sizeof() é um alias para count().

source: See also count().
pt_br: Veja também count().

source: The sleep() function delays program execution for the given number of seconds.
pt_br: A função sleep() atrasa a execução do programa de acordo com a quantidade de segundos dados no parâmetro seconds.

source: See also usleep() and set_time_limit()
pt_br: Veja também usleep() e set_time_limit()

source: Sets the value of quick_print within the UCD SNMP library.
pt_br: Description

source: Returns TRUE on success or FALSE on failure. socket_getpeername() may also return FALSE if the socket type is not any of AF_INET or AF_UNIX, in which case the last socket error code is not updated.
pt_br: Retorna TRUE em caso de sucesso ou FALSE em falhas. socket_getpeername() may also return FALSE if the socket type is not any of AF_INET or AF_UNIX, in which case the last socket error code is not updated.

source: Returns TRUE on success or FALSE on failure. socket_getsockname() may also return FALSE if the socket type is not any of AF_INET or AF_UNIX, in which case the last socket error code is not updated.
pt_br: Retorna TRUE em caso de sucesso ou FALSE em falhas. socket_getsockname() may also return FALSE if the socket type is not any of AF_INET or AF_UNIX, in which case the last socket error code is not updated.

source: This function is an alias of stream_get_meta_data().
pt_br: socket_get_status - - Alias of stream_get_meta_data().

source: This function is an alias for stream_set_blocking().
pt_br: socket_set_blocking - - Alias for stream_set_blocking()

source: This is an alias for stream_set_timeout().
pt_br: socket_set_timeout - - Alias for stream_set_timeout()

source: Example 1. socket_strerror() example
pt_br: Exemplo 1. socket_strerror() example

source: The old_function statement allows you to declare a function using a syntax identical to PHP / FI2 (except you must replace'function 'with'old_function'.
pt_br: O comando old_function permite que você declare uma função usando uma sintaxe idêntica ao PHP / FI2 (exceto pelo fato de que você precisa substituir 'function 'com 'old_function').

source: This is a deprecated feature, and should only be used by the PHP / FI2 - PHP 3 convertor.
pt_br: Esta é uma implementação obsoleta, e deve ser usada somente pelo conversor PHP / FI2 - PHP3.

source: Functions declared as old_function cannot be called from PHP 's internal code.
pt_br: Funções declaradas como old_function não podem ser chamadas a partir de código interno do PHP.

source: Among other things, this means you can' t use them in functions such as usort(), array_walk(), and register_shutdown_function().
pt_br: Entre outras coisas, isso significa que você não pode usá-las em funções como usort(), array_walk() e register_shutdown_function().

source: You can get around this limitation by writing a wrapper function (in normal PHP 3 form) to call the old_function.
pt_br: Você pode contornar essa limitação escrevendo um invólucro de função (no formato PHP3 normal) para chamar o old_function.

source: Variable functions
pt_br: Funções variáveis

source: This function sorts an array.
pt_br: Descrição

source: Elements will be arranged from lowest to highest when this function has completed.
pt_br: Os elementos serão ordenados do menor para o maior ao final da execução dessa função.

source: Example 1. sort() example
pt_br: Exemplo de sort()

source: ?php $fruits = array ("lemon", "orange", "banana", "apple"); sort ($fruits); reset ($fruits); while (list ($key, $val) = each ($fruits)) {echo "fruits[".$key ."] = ".$val ."\n";}?
pt_br: ?php $frutas = array ("limao", "laranja", "banana", "melancia"); sort ($frutas); reset ($frutas); while (list ($chave, $valor) = each ($frutas)) {echo "frutas[".$chave ."] = ".$valor ."\n";}?

source: fruits[ 0] = apple fruits[1] = banana fruits[2] = lemon fruits[3] = orange
pt_br: fruits[ 0] = banana fruits[1] = laranja fruits[2] = limao fruits[3] = melancia

source: The fruits have been sorted in alphabetical order.
pt_br: As frutas foram classificadas em ordem alfabética.

source: The optional second parameter sort_flags may be used to modify the sorting behavior using these values:
pt_br: O segundo argumento opcional sort_flags pode ser usado para modificar o comportamento da ordenação podendo receber os seguintes valores:

source: See also arsort(), asort(), ksort(), natsort(), natcasesort(), rsort(), usort(), array_multisort(), and uksort().
pt_br: Veja também arsort(), asort(), ksort(), natsort(), natcasesort(), rsort(), usort(), array_multisort() e uksort().

source: Calculates the soundex key of str.
pt_br: Description

source: Example 1. split() Example
pt_br: Exemplo 1. split() Example

source: Example 2. split() Example
pt_br: Exemplo 2. split() Example

source: Returns a string produced according to the formatting string format.
pt_br: Description

source: See also printf(), sscanf(), fscanf(), vsprintf(), and number_format().
pt_br: Examples
